Vladimir-Trufanov/ittve-ESP32/05-CameraDachServer/CameraDachServer/app_httpd.cpp
/** Arduino, ESP32, C/C++ *********************************** app_httpd.cpp ***
 * 
 * Построить работу сервера потока изображений
 * 
 * v4.0.5, 16.03.2026                                 Автор:      Труфанов В.Е.
 * Copyright © 2026 tve                               Дата создания: 26.02.2026
 * 
**/
#include "arduino.h"

#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include "board_config.h"

#include "rLog.h" 
#include <WiFi.h>

#include "help.page"

// Параметры локальной и собственной сети контроллера для передачи в html
char hssid[12];     // не более 11 символов, латиница
char hlocalIP[18];
char hsoftAPIP[18];

// ****************************************************************************
// *   Инициируем работу контроллера, как станции WiFi и с собственной сетью  *
// ****************************************************************************
void IniSayWiFi()
{
  // Инициируем hssid, hlocalIP, hsoftAPIP - параметры локальной и собственной 
  // сети контроллера для передачи в html
  String(WiFi.SSID()).toCharArray(hssid,String(WiFi.SSID()).length()+1); 
  String ipaddr=WiFi.localIP().toString(); ipaddr.toCharArray(hlocalIP,ipaddr.length()+1); 
  ipaddr=WiFi.softAPIP().toString(); ipaddr.toCharArray(hsoftAPIP,ipaddr.length()+1); 
  Serial.print("IP - собственной сети: ");  Serial.print(hsoftAPIP); Serial.print("  "); Serial.println(soft_ap_ssid);
  Serial.print("IP - рабочей станции:  ");  Serial.print(hlocalIP);  Serial.print("  "); Serial.println(hssid);

  /*
  // Указываем учетные данные Wi-Fi
  // "OPPO A9 2020"; "TP-Link_B394"; "tve-DESKTOP"; "linksystve"; "linksystve";
  // "b277a4ee84e8"; "18009217"    ; "Ue18-647"   ; "x93k6kq6wf"; "X93K6KQ6WF";
  const char* ssid     = "OPPO A9 2020";
  const char* password = "b277a4ee84e8";

  WiFi.mode(WIFI_MODE_APSTA);
  char* soft_apssid = soft_ap_ssid;      // не более 10 символов, латиница
  WiFi.softAP(soft_apssid, soft_apssid);

  // Подключаемся к WiFi
  WiFi.begin(ssid, password);
  WiFi.setSleep(false);
  Serial.print("Подключение к WiFi");
  while (WiFi.status() != WL_CONNECTED) 
  {
    delay(500);
    Serial.print(".");
  }
  Serial.println("");
  Serial.println("WiFi подключен");
  // Заполняем параметры для передачи в html через status_handler 
  // [Вывод IPAddress в HTML](https://arduino.ru/forum/programmirovanie/vyvod-ipaddress-v-html)
  String(ssid).toCharArray(hssid,String(ssid).length()+1); 
  String ipaddr=WiFi.localIP().toString(); ipaddr.toCharArray(hlocalIP,ipaddr.length()+1); 
  ipaddr=WiFi.softAPIP().toString(); ipaddr.toCharArray(hsoftAPIP,ipaddr.length()+1); 
  */

}

/*
    ARDUINO_ARCH_ESP32 — макрос, который определяется при компиляции с использованием 
  ядра ESP32 для Arduino. Он указывает на то, что плата — на базе микроконтроллера ESP32. 
  Макрос одинаков для всех чипов ESP32-x, например, нет ARDUINO_ARCH_ESP32_S2. 
    Макрос ARDUINO_ARCH_ESP32 используется в коде для проверки, что плата — ESP32. 
    Однако есть и ограничение: макрос ARDUINO_ARCH_ESP32 не определяется при работе 
  с ESP-IDF и arduino-esp32 как компонентом в других средах разработки. 

  ARDUHAL_LOG_LEVEL — макрос, который определяет уровень ведения журнала в Arduino ESP32. 
  Он переопределяет макросы ESP-IDF, которые поддерживают пять уровней: 
    ARDUHAL_LOG_LEVEL_NONE — нет вывода журнала;
    ARDUHAL_LOG_LEVEL_ERROR — критические ошибки, модуль программного обеспечения не может восстановиться самостоятельно;
    ARDUHAL_LOG_LEVEL_WARN — предупреждение;
    ARDUHAL_LOG_LEVEL_INFO — информация;
    ARDUHAL_LOG_LEVEL_DEBUG — отладка;
    ARDUHAL_LOG_LEVEL_VERBOSE — подробное ведение журнала.
  По умолчанию уровень ведения журнала в Arduino ESP32 установлен на ARDUHAL_LOG_LEVEL_NONE. 
  Уровень ведения журнала можно настроить: 
    во время компиляции — с помощью опции CORE_DEBUG_LEVEL. Например, можно указать CORE_DEBUG_LEVEL=5. 
  Для PlatformIO — через опцию build_flags = -DCORE_DEBUG_LEVEL=5; 
    во время выполнения — с помощью функции esp_log_level_set. Можно установить уровень глобально 
  или для конкретного модуля (идентификатора). Модули идентифицируются тегами — строками ASCII с 
  нулевым завершением. Например, чтобы установить уровень ведения журнала на ERROR для всех компонентов, 
  нужно вызвать esp_log_level_set("*", ESP_LOG_ERROR). 
    Для конкретного файла источника — с помощью определения LOG_LOCAL_LEVEL. Оно позволяет переопределить 
  максимальный уровень ведения журнала для конкретного файла без изменения опций Kconfig. 
  Например, в файле my_file.c можно определить LOG_LOCAL_LEVEL ESP_LOG_VERBOSE перед включением esp_log.h. 
  Важно: не добавлять LOG_LOCAL_LEVEL в файлы заголовков — это может не работать 
  из-за подхода однократного включения, используемого в файлах заголовков. 

  В некоторых случаях настройка уровня ведения журнала не работает. Например: 
  esp_log_level_set() не изменяет уровень — в этом случае может потребоваться перестроить библиотеки.
  Журналы печатаются только для одного уровня — например, для log_e(), а не для других уровней (log_d(), 
  log_w(), log_i()). В этом случае нужно определить CORE_DEBUG_LEVEL как флаг сборки в файле platformio.ini.
 
  Важно: Arduino использует свои функции ведения журнала, и ESP_LOG работает только для IDF 
  (и действует на уже скомпилированные библиотеки). Вместо ESP_LOGx() в Arduino ESP32 
  используются функции log_x(). 

  ARDUHAL_LOG_LEVEL_INFO — это уровень ведения журнала в платформе ESP32. 
  Уровень ведения журнала определяет серьёзность сообщения. Некоторые значения уровней:
  ESP_LOG_NONE — нет вывода журнала;
  ESP_LOG_ERROR — критические ошибки, модуль программного обеспечения не может восстановиться самостоятельно;
  ESP_LOG_WARN — условия ошибок, из которых были приняты меры по восстановлению;
  ESP_LOG_INFO — сообщения информации, которые описывают нормальный поток событий;
  ESP_LOG_DEBUG — дополнительная информация, которая не необходима для нормального использования (значения, указатели, размеры и т. д.).
  
  Уровни ведения журнала настраиваются отдельно для приложения и загрузчика. 
  Это позволяет разработчикам применять разные настройки ведения журнала для каждого из них с помощью опций Kconfig. 

  Настроить уровень журнала в ESP32 можно двумя способами: во время компиляции и во время выполнения. 
  Во время компиляции:
  В menuconfig установить уровень детализации с помощью опции CONFIG_LOG_DEFAULT_LEVEL (уровень по умолчанию).
  При желании также в menuconfig установить максимальный уровень детализации с помощью опции CONFIG_LOG_MAXIMUM_LEVEL.
  По умолчанию это то же самое, что и CONFIG_LOG_DEFAULT_LEVEL, но его можно установить выше, 
  чтобы добавить в прошивку больше необязательных сообщений.
  Можно переопределить уровень детализации по умолчанию для отдельных модулей или файлов, 
  используя макрос LOG_LOCAL_LEVEL. Его можно определить прямо в файле перед подключением esp_log.h.
 
  Во время выполнения:
  Все журналы для уровней детализации ниже CONFIG_LOG_DEFAULT_LEVEL включены по умолчанию.
  Для установки уровня детализации для каждого модуля отдельно можно использовать функцию esp_log_level_set(). 
  Для этого используется тег.

  Важно учитывать, что эта функция не может поднять уровень журнала выше уровня, 
  установленного с помощью параметра CONFIG_LOG_MAXIMUM_LEVEL в menuconfig. 
*/
//   esp32-hal-log.h — библиотека для работы с логированием на микроконтроллере ESP32, 
// которая «встроена» в Framework Arduino для ESP32. 
//   esp_log.h — библиотека логирования, доступная в фреймворке ESP-IDF. 
// Таким образом, esp32-hal-log.h предоставляет дополнительные возможности 
// для работы с логированием, которые не доступны в esp_log.h.
typedef struct 
{
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

typedef struct 
{
  size_t size;   // количество значений, используемых для фильтрации
  size_t index;  // текущий индекс
  size_t count;  // счетчик
  int sum;
  int *values;   // массив для заполнения значениями фильтрации
} ra_filter_t;

