Vladimir-Trufanov/ittve-ESP32/05-CameraDachServer/CameraDachServer/app_httpd.cpp
  p += print_reg(p, s, 0xd3, 0xFF);
  p += print_reg(p, s, 0x111, 0xFF);
  p += print_reg(p, s, 0x132, 0xFF);
  // ***xclk***=4, готовим значение частоты входного тактового сигнала
  // для передачи на страницу управления камерой
  // p += sprintf(p, "\"xclk\":%u,", s->xclk_freq_hz / 1000000);
  p += sprintf(p, "\"pixformat\":%u,", s->pixformat);
  p += sprintf(p, "\"framesize\":%u,", s->status.framesize);
  p += sprintf(p, "\"quality\":%u,", s->status.quality);
  p += sprintf(p, "\"brightness\":%d,", s->status.brightness);
  p += sprintf(p, "\"contrast\":%d,", s->status.contrast);
  p += sprintf(p, "\"saturation\":%d,", s->status.saturation);
  p += sprintf(p, "\"sharpness\":%d,", s->status.sharpness);
  p += sprintf(p, "\"special_effect\":%u,", s->status.special_effect);
  p += sprintf(p, "\"wb_mode\":%u,", s->status.wb_mode);
  // 2026-03-11 Параметры экспозиции закрыли на странице,
  // а здесь возвращаем на запрос наибольшие значения
  p += sprintf(p, "\"aec\":%u,", 1);           // p += sprintf(p, "\"aec\":%u,", s->status.aec);
  p += sprintf(p, "\"aec2\":%u,", 1);          // p += sprintf(p, "\"aec2\":%u,", s->status.aec2);
  p += sprintf(p, "\"aec_value\":%u,", 1200);  // p += sprintf(p, "\"aec_value\":%u,", s->status.aec_value);
  // 2026-03-11 Параметры освещенности закрыли на странице,
  // а здесь возвращаем на запрос наибольшие значения
  p += sprintf(p, "\"agc\":%u,", 1);           // p += sprintf(p, "\"agc\":%u,", s->status.agc);
  p += sprintf(p, "\"agc_gain\":%u,", 31);     // p += sprintf(p, "\"agc_gain\":%u,", s->status.agc_gain);
  p += sprintf(p, "\"gainceiling\":%u,", 6);   // p += sprintf(p, "\"gainceiling\":%u,", s->status.gainceiling);
  // С остальными параметрами работаем
  p += sprintf(p, "\"ae_level\":%d,", s->status.ae_level);
  p += sprintf(p, "\"bpc\":%u,", s->status.bpc);
  p += sprintf(p, "\"wpc\":%u,", s->status.wpc);
  p += sprintf(p, "\"raw_gma\":%u,", s->status.raw_gma);
  p += sprintf(p, "\"lenc\":%u,", s->status.lenc);
  p += sprintf(p, "\"hmirror\":%u,", s->status.hmirror);
  p += sprintf(p, "\"vflip\":%u,", s->status.vflip);
  p += sprintf(p, "\"colorbar\":%u,", s->status.colorbar);
  // Включаем параметры локальной и собственной сети контроллера 
  p += sprintf(p, "\"hssid\":\"%s\",",        hssid);
  p += sprintf(p, "\"hlocalIP\":\"%s\",",     hlocalIP);
  p += sprintf(p, "\"soft_ap_ssid\":\"%s\",", soft_ap_ssid);
  p += sprintf(p, "\"hsoftAPIP\":\"%s\"",     hsoftAPIP);
  *p++ = '}';
  *p++ = 0;
  
  // Трассируем в параметры потока изображений
  Serial.println("Параметры потока изображений: ");
  Serial.println(json_response);
  // Возвращаем ответ на запрос с указанием параметров в json-строке
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json_response, strlen(json_response));
}
// ***xclk***=3, обработчика HTTP-запроса по изменению частоты
// входного тактового сигнала
/*
static esp_err_t xclk_handler(httpd_req_t *req) 
{
  char *buf = NULL;
  char _xclk[32];

  if (parse_get(req, &buf) != ESP_OK) 
  {
    return ESP_FAIL;
  }
  if (httpd_query_key_value(buf, "xclk", _xclk, sizeof(_xclk)) != ESP_OK) 
  {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  int xclk = atoi(_xclk);
  log_i("Set XCLK: %d MHz", xclk);

  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_xclk(s, LEDC_TIMER_0, xclk);
  if (res) 
  {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}
*/
static esp_err_t reg_handler(httpd_req_t *req) 
{
  char *buf = NULL;
  char _reg[32];
  char _mask[32];
  char _val[32];

  if (parse_get(req, &buf) != ESP_OK) 
  {
    return ESP_FAIL;
  }
  if (httpd_query_key_value(buf,"reg",_reg,sizeof(_reg)) != ESP_OK || httpd_query_key_value(buf,"mask", _mask,sizeof(_mask)) != ESP_OK
      || httpd_query_key_value(buf,"val", _val,sizeof(_val)) != ESP_OK) 
  {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  int reg = atoi(_reg);
  int mask = atoi(_mask);
  int val = atoi(_val);
  log_i("Set Register: reg: 0x%02x, mask: 0x%02x, value: 0x%02x", reg, mask, val);

  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_reg(s, reg, mask, val);
  if (res) 
  {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t greg_handler(httpd_req_t *req) 
{
  char *buf = NULL;
  char _reg[32];
  char _mask[32];

  if (parse_get(req, &buf) != ESP_OK) 
  {
    return ESP_FAIL;
  }
  if (httpd_query_key_value(buf, "reg", _reg, sizeof(_reg)) != ESP_OK || httpd_query_key_value(buf, "mask", _mask, sizeof(_mask)) != ESP_OK) 
  {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  int reg = atoi(_reg);
  int mask = atoi(_mask);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->get_reg(s, reg, mask);
  if (res < 0) 
  {
    return httpd_resp_send_500(req);
  }
  log_i("Get Register: reg: 0x%02x, mask: 0x%02x, value: 0x%02x", reg, mask, res);

  char buffer[20];
  const char *val = itoa(res, buffer, 10);
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, val, strlen(val));
}

static int parse_get_var(char *buf, const char *key, int def) 
{
  char _int[16];
  if (httpd_query_key_value(buf, key, _int, sizeof(_int)) != ESP_OK) 
  {
    return def;
  }
  return atoi(_int);
}

static esp_err_t pll_handler(httpd_req_t *req) 
{
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) 
  {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d",bypass,mul,sys,root,pre,seld5,pclken,pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) 
  {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}
// ****************************************************************************
// *                           Развернуть главную страницу                    *
// ****************************************************************************
static esp_err_t index_handler(httpd_req_t *req) 
{
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s != NULL) 
  {
    // Запускаем управляющуюю html-страницу и возвращаем ответ
    return httpd_resp_send(req, (const char *)index_ov2640_html_gz, index_ov2640_html_gz_len);
  }
  else 
  {
    log_e("Датчик камеры не найден");
    return httpd_resp_send_500(req);
  }
}
// ****************************************************************************
// *                 Развернуть страницу помощи по камере                     *
// ****************************************************************************
static esp_err_t help_handler(httpd_req_t *req) 
{
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, help_page, HTTPD_RESP_USE_STRLEN);
}
// ****************************************************************************
// *                           Запустить в работу камеру                      *
// ****************************************************************************
void startCameraServer() 
{
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.max_uri_handlers = 12;
  // httpd_uri_t:1
  httpd_uri_t index_uri = 
  {
    .uri = "/",
    .method = HTTP_GET,
    .handler = index_handler,
    .user_ctx = NULL
    #ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
    #endif
  };
  // httpd_uri_t:2
  httpd_uri_t status_uri = 
  {
    .uri = "/status",
    .method = HTTP_GET,
    .handler = status_handler,
    .user_ctx = NULL
    #ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
    #endif
  };
  // httpd_uri_t:3
  httpd_uri_t cmd_uri = 
  {
    .uri = "/control",
    .method = HTTP_GET,
    .handler = cmd_handler,
    .user_ctx = NULL
    #ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
    #endif
  };
  // httpd_uri_t:4
  httpd_uri_t capture_uri = 
  {
    .uri = "/capture",
    .method = HTTP_GET,
    .handler = capture_handler,
    .user_ctx = NULL
    #ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
    #endif
  };
  // httpd_uri_t:5
  httpd_uri_t stream_uri = 
  {
    .uri = "/stream",
    .method = HTTP_GET,
    .handler = stream_handler,
    .user_ctx = NULL
    #ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
    #endif
  };
  // httpd_uri_t:6
  httpd_uri_t bmp_uri = 
  {
    .uri = "/bmp",
    .method = HTTP_GET,
    .handler = bmp_handler,
    .user_ctx = NULL
    #ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
    #endif
  };
  // ***xclk***=2, регистрация URI-обработчика HTTP-запроса по изменению частоты
  // входного тактового сигнала
  /*
  httpd_uri_t xclk_uri = 
  {
    .uri = "/xclk",
    .method = HTTP_GET,
    .handler = xclk_handler,
    .user_ctx = NULL
    #ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
    #endif
  };
  */
  // httpd_uri_t:7
  httpd_uri_t reg_uri = 
  {
    .uri = "/reg",
    .method = HTTP_GET,
    .handler = reg_handler,
    .user_ctx = NULL
    #ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
    #endif
  };
  // httpd_uri_t:8
  httpd_uri_t greg_uri = 
  {
    .uri = "/greg",
    .method = HTTP_GET,
    .handler = greg_handler,
    .user_ctx = NULL
    #ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
    #endif
  };
  // httpd_uri_t:9
  httpd_uri_t pll_uri = 
  {
    .uri = "/pll",
    .method = HTTP_GET,
    .handler = pll_handler,
    .user_ctx = NULL
    #ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
    #endif
  };
  // httpd_uri_t:10
  httpd_uri_t help_uri = 
  {
    .uri = "/help",
    .method = HTTP_GET,
    .handler = help_handler,
    .user_ctx = NULL
    #ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
    #endif
  };

  ra_filter_init(&ra_filter, 20);
  log_i("Запущен веб-сервер по порту: '%d'", config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK) 
  {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &bmp_uri);
    // ***xclk***=9, подключаем обработчик по изменению частоты тактового сигнала
    // httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &reg_uri);
    httpd_register_uri_handler(camera_httpd, &greg_uri);
    httpd_register_uri_handler(camera_httpd, &pll_uri);
    httpd_register_uri_handler(camera_httpd, &help_uri);
  }

  config.server_port += 1;
  config.ctrl_port += 1;
  log_i("Запущен веб-сервер по порту: '%d'", config.server_port);
  if (httpd_start(&stream_httpd, &config) == ESP_OK) 
  {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
  }
}

// ********************************************************** app_httpd.cpp ***
